FemDesign.Loads.LoadCategoryDatabase
Material database.

FemDesign.Loads.LoadCategoryDatabase.#ctor
Parameterless constructor for serialization.

FemDesign.Loads.LoadCategoryDatabase.LoadCategoryNames
Lists the names of all Load Categories in LoadCategoryDatabase.
Returns: List of load category names.

FemDesign.Loads.LoadCategoryDatabase.LoadCategoryByName(System.String)
Get load category from LoadCategoryDatabase by name.
loadCategoryName: Name of load type
Returns:

FemDesign.Loads.LoadCategoryDatabase.DeserializeResource(System.String)
Deserialize LoadCategoryDatabase from embedded resource.

FemDesign.Loads.LoadCategoryDatabase.GetDefault(System.String)
Load the default LoadCoefficientDatabase for each respective country.
Remarks: Create
countryCode: National annex of calculation code (D/DK/EST/FIN/GB/H/N/PL/RO/S/TR)
Returns:

FemDesign.Loads.LoadCategoryDatabase.Serialize(System.String)
Serialize LoadCoefficientsDatabase to file (.struxml).